'''我们的首页'''
import streamlit as st

st.write(':orange[:sunglasses: Python网络根据地兄弟姐妹们班级的根据地 :sunglasses:]')

st.image("logo.png")
st.write('-----------------------------------------------')
st.text(
'''这里是Python大佬们班级的根据地。由金金老师和他的同学们一同创建。
你是否想要了解互联网知识，探索网络的奥秘和和魅力？
在这门课程中，我们一起深度畅游网络世界，学习新的超级工具，
创建和运行自己的网页应用，添加界面元素，设计交互功能，收集和掌握数据。
你还将重新认识互联网，了解互联网的发展历史和现状，以及网络对我们生活和社会的影响。
经过7天的学习和探索，结合新的技巧、新的认知，制作出真正属于自己的网络根据地！'''
)
st.write('-----------------------------------------------')
# st.image('合影截图')
st.text(
'''    恭喜同学们顺利完成本次【我的网络根据地】暑期创作营课程！很高兴能和同学们度过这段编创时光，大家真的
都做得很棒，老师为你们感到骄傲 ！也恭喜大家完成源码训练师到游戏开发工程师的成长蜕变！
    相信你们经过这7天的学习旅途，都有自己的收获和成果，老师也非常感谢大家的这些天的配合，也希望这
段努力的时光在同学们的成长过程里留下深刻印记！

期待各位同学继续完善自己的项目，上传完整作业文件夹+录制介绍视频~
附：最终作品提交要求 + 创作营作品提交指南.mp4


祝同学们学业进步！天天开心！'''
)